web/application/files/fedex/wsdl/GlobalShipAddress/GetAvailableCities_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://fedex.com/ws/gsai/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:AvailableCitiesRequest>
         <v1:WebAuthenticationDetail>
            <v1:CspCredential>
               <v1:Key></v1:Key>
               <v1:Password></v1:Password>
            </v1:CspCredential>
            <v1:UserCredential>
               <v1:Key></v1:Key>
               <v1:Password></v1:Password>
            </v1:UserCredential>
         </v1:WebAuthenticationDetail>
         <v1:ClientDetail>
            <v1:AccountNumber></v1:AccountNumber>
            <v1:MeterNumber></v1:MeterNumber>
            <v1:Region>US</v1:Region>
            <v1:Localization>
               <v1:LanguageCode>EN</v1:LanguageCode>
               <v1:LocaleCode>US</v1:LocaleCode>
            </v1:Localization>
         </v1:ClientDetail>
         <v1:TransactionDetail>
            <v1:CustomerTransactionId>AvailableCitiesRequest</v1:CustomerTransactionId>
            <v1:Localization>
               <v1:LanguageCode>EN</v1:LanguageCode>
               <v1:LocaleCode>US</v1:LocaleCode>
            </v1:Localization>
         </v1:TransactionDetail>
         <v1:Version>
            <v1:ServiceId>gsai</v1:ServiceId>
            <v1:Major>1</v1:Major>
            <v1:Intermediate>0</v1:Intermediate>
            <v1:Minor>0</v1:Minor>
         </v1:Version>
         <v1:CarrierCodes>FDXE</v1:CarrierCodes>
         <v1:MatchAndResultCriteria>
            <v1:MatchAddress>
               <v1:StreetLines>10 FED EX PKWY FL 2</v1:StreetLines>
               <v1:City>COLLIERVILLE</v1:City>
               <v1:StateOrProvinceCode>TN</v1:StateOrProvinceCode>
               <v1:PostalCode>38017</v1:PostalCode>
               <v1:CountryCode>US</v1:CountryCode>
               <v1:Residential>1</v1:Residential>
            </v1:MatchAddress>
            <v1:MatchStateOrProvinceName>TN</v1:MatchStateOrProvinceName>
            <v1:MatchStoreNumber>15</v1:MatchStoreNumber>
            <v1:MatchLocationTypes>FEDEX_EXPRESS_STATION</v1:MatchLocationTypes>
            <v1:MatchLocationId>5</v1:MatchLocationId>
            <v1:MatchConditions>MATCH_BY_EXACT_CITY</v1:MatchConditions>
            <v1:ResultsToSkip>0</v1:ResultsToSkip>
            <v1:ResultsRequested>5</v1:ResultsRequested>
            <v1:ResultConditions>INCLUDE_ROUTING_CODES_ONLY</v1:ResultConditions>
         </v1:MatchAndResultCriteria>
      </v1:AvailableCitiesRequest>
   </soapenv:Body>
</soapenv:Envelope>